#include "LQueue.h"

int menu()
{
	/*菜单*/
	printf("\r\n");
	printf("\r\n");
	printf("\r\n");
	printf("	                              ============\r\n");
	printf("                              *****链式队列功能菜单************************\r\n");
	printf("                                1-------------------初始化队列\r\n");
	printf("                                2-------------------销毁队列\r\n");
	printf("                                3-------------------检查队列是否为空\r\n");
	printf("                                4-------------------查看队头元素\r\n");
	printf("                                5-------------------确定队列长度\r\n");
	printf("                                6-------------------入队操作\r\n");
	printf("                                7-------------------出队操作\r\n");
	printf("                                8-------------------清空队列\r\n");
	printf("                                9-------------------遍历队列\r\n");
	printf("                                0-------------------退出\r\n");
	printf("                              *******************************************\r\n");

	/*输入选项*/
	printf("请输入想要操作的选项*_* :");
	int num = 0;
	scanf("%d", &num);
	return num;
}


