#include "binary_sort_tree.h"

int menu()
{
	/*菜单*/
	printf("\r\n");
	printf("\r\n");
	printf("\r\n");
	printf("	                              ============\r\n");
	printf("                              ********二叉排序树功能菜单************************\r\n");
	printf("                                1-------------------初始化\r\n");
	printf("                                2-------------------查找\r\n");
	printf("                                3-------------------插入\r\n");
	printf("                                4-------------------删除\r\n");
	printf("                                5-------------------先序遍历（递归版）\r\n");
	printf("                                6-------------------中序遍历（递归版）\r\n");
	printf("                                7-------------------后序遍历（递归版）\r\n");
	printf("                                0-------------------退出\r\n");
	printf("                              *******************************************\r\n");
	
	int num;
	printf("请输入选项：");
	scanf("%d", &num);
	return num;


}