#include"LinkStack.h"

int menu()
{	
	/*菜单*/
	printf("\r\n");
	printf("\r\n");
	printf("\r\n");
	printf("	                              ============\r\n");
	printf("                              ********链栈功能菜单************************\r\n");
	printf("                                1-------------------初始化栈\r\n");
	printf("                                2-------------------判断栈是否为空\r\n");
	printf("                                3-------------------得到栈顶元素\r\n");
	printf("                                4-------------------清空栈\r\n");
	printf("                                5-------------------销毁栈\r\n");
	printf("                                6-------------------检测栈长度\r\n");
	printf("                                7-------------------入栈\r\n");
	printf("                                8-------------------出栈\r\n");
	printf("                                0-------------------退出\r\n");
	printf("                              *******************************************\r\n");
	
	/*输入选项*/
	printf("请输入想要操作的选项*_* :");
	int num = 0;
	scanf("%d", &num);
	return num;
}